OpenFOAM case folders/Experimental validation/Calm water resistance/KCS/Fr0.1083/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
	version    2.0;
	format     ascii;
	class      dictionary;
	object     blockMeshDict;
}

scale 1;

vertices
(
	(-14.646463329094928 0 -8.002206785763786)
	(21.969694993642392 0 -8.002206785763786)
	(21.969694993642392 9.21466235936436 -8.002206785763786)
	(-14.646463329094928 9.21466235936436 -8.002206785763786)
	(-14.646463329094928 0 3.879857835521835)
	(21.969694993642392 0 3.879857835521835)
	(21.969694993642392 9.21466235936436 3.879857835521835)
	(-14.646463329094928 9.21466235936436 3.879857835521835)
);

edges
(

);

blocks
(
	hex (0 1 2 3 4 5 6 7) (151 38 49) simpleGrading (1 1 1)
);

boundary
(
	inlet
	{
		type patch;
		faces
		(
			(0 4 7 3)
			(3 2 6 7)
			(0 3 2 1)
		);
	}
	midPlane
	{
		type symmetryPlane;
		faces
		(
			(0 1 5 4)
		);
	}
	outlet
	{
		type patch;
		faces
		(
			(2 6 5 1)
		);
	}
	top
	{
		type patch;
		faces
		(
			(4 5 6 7)
		);
	}
);

