OpenFOAM case folders/Experimental validation/Calm water resistance/KCS/Fr0.1083/0.org/include/initialConditions
flowVelocity          (0.915139 0 0);
Umean                  0.915139;
turbulentKE            1.256218e-04;
turbulentOmega         6.286502e-01;
turbulentEpsilon       4.152852e-04;
turbulentNut           3.420000e-06;
transitionTu           1.000000e+00;
transitionLambdaTheta  0.000000e+00;
transitionFLambdaTheta 1.000000e+00;
transitionReThetat     5.843016e+02;
#inputMode       merge;